results-tika-jvm/run_4_2026-01-05_01-45-21/FIXED-1000-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8004
  16 threads and 16 connections
  Thread calibration: mean lat.: 139.721ms, rate sampling interval: 1193ms
  Thread calibration: mean lat.: 171.471ms, rate sampling interval: 1266ms
  Thread calibration: mean lat.: 151.717ms, rate sampling interval: 1273ms
  Thread calibration: mean lat.: 131.833ms, rate sampling interval: 1159ms
  Thread calibration: mean lat.: 180.783ms, rate sampling interval: 1328ms
  Thread calibration: mean lat.: 147.002ms, rate sampling interval: 1195ms
  Thread calibration: mean lat.: 147.100ms, rate sampling interval: 1161ms
  Thread calibration: mean lat.: 144.800ms, rate sampling interval: 1197ms
  Thread calibration: mean lat.: 161.390ms, rate sampling interval: 1288ms
  Thread calibration: mean lat.: 122.321ms, rate sampling interval: 1137ms
  Thread calibration: mean lat.: 139.742ms, rate sampling interval: 1193ms
  Thread calibration: mean lat.: 139.541ms, rate sampling interval: 1242ms
  Thread calibration: mean lat.: 158.955ms, rate sampling interval: 1273ms
  Thread calibration: mean lat.: 152.316ms, rate sampling interval: 1195ms
  Thread calibration: mean lat.: 135.965ms, rate sampling interval: 1153ms
  Thread calibration: mean lat.: 133.881ms, rate sampling interval: 1106ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.20ms    3.01ms  35.52ms   95.98%
    Req/Sec    61.96      0.38    63.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.65ms
 75.000%    3.29ms
 90.000%    3.89ms
 99.000%   21.66ms
 99.900%   28.45ms
 99.990%   34.49ms
 99.999%   35.55ms
100.000%   35.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.089     0.000000            1         1.00
       1.746     0.100000         1997         1.11
       1.991     0.200000         4001         1.25
       2.189     0.300000         6001         1.43
       2.409     0.400000         8005         1.67
       2.649     0.500000         9991         2.00
       2.771     0.550000        10988         2.22
       2.897     0.600000        11989         2.50
       3.027     0.650000        12981         2.86
       3.153     0.700000        13985         3.33
       3.287     0.750000        14987         4.00
       3.363     0.775000        15479         4.44
       3.439     0.800000        15979         5.00
       3.523     0.825000        16475         5.71
       3.621     0.850000        16981         6.67
       3.735     0.875000        17477         8.00
       3.807     0.887500        17723         8.89
       3.893     0.900000        17974        10.00
       4.005     0.912500        18225        11.43
       4.187     0.925000        18473        13.33
       4.447     0.937500        18721        16.00
       4.655     0.943750        18846        17.78
       4.971     0.950000        18971        20.00
       5.651     0.956250        19096        22.86
       6.963     0.962500        19222        26.67
       9.335     0.968750        19345        32.00
      10.463     0.971875        19408        35.56
      11.495     0.975000        19470        40.00
      12.663     0.978125        19533        45.71
      14.687     0.981250        19595        53.33
      18.159     0.984375        19657        64.00
      19.663     0.985938        19689        71.11
      20.559     0.987500        19720        80.00
      21.327     0.989062        19751        91.43
      22.111     0.990625        19782       106.67
      22.831     0.992188        19813       128.00
      23.519     0.992969        19829       142.22
      23.983     0.993750        19845       160.00
      24.383     0.994531        19861       182.86
      24.847     0.995313        19876       213.33
      25.519     0.996094        19891       256.00
      25.743     0.996484        19899       284.44
      26.207     0.996875        19907       320.00
      26.383     0.997266        19916       365.71
      26.623     0.997656        19923       426.67
      26.959     0.998047        19930       512.00
      27.295     0.998242        19934       568.89
      27.679     0.998437        19938       640.00
      28.079     0.998633        19942       731.43
      28.303     0.998828        19946       853.33
      28.447     0.999023        19950      1024.00
      28.783     0.999121        19952      1137.78
      29.023     0.999219        19954      1280.00
      29.311     0.999316        19956      1462.86
      29.359     0.999414        19958      1706.67
      30.047     0.999512        19960      2048.00
      30.895     0.999561        19961      2275.56
      30.927     0.999609        19962      2560.00
      31.503     0.999658        19963      2925.71
      33.247     0.999707        19964      3413.33
      33.695     0.999756        19965      4096.00
      33.695     0.999780        19965      4551.11
      33.919     0.999805        19966      5120.00
      33.919     0.999829        19966      5851.43
      34.495     0.999854        19967      6826.67
      34.495     0.999878        19967      8192.00
      34.495     0.999890        19967      9102.22
      35.487     0.999902        19968     10240.00
      35.487     0.999915        19968     11702.86
      35.487     0.999927        19968     13653.33
      35.487     0.999939        19968     16384.00
      35.487     0.999945        19968     18204.44
      35.551     0.999951        19969     20480.00
      35.551     1.000000        19969          inf
#[Mean    =        3.202, StdDeviation   =        3.009]
#[Max     =       35.520, Total count    =        19969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29990 requests in 30.01s, 2.63MB read
Requests/sec:    999.45
Transfer/sec:     89.79KB